Tekla.Structures.ModelInternal.dotLegSurfaceObject_t
The structure for passing leg surface object data between OpenAPI and core.

Tekla.Structures.ModelInternal.dotLegSurfaceObject_t.SurfaceObject
The surface object.

Tekla.Structures.ModelInternal.dotLegSurfaceObject_t.RebarSetId
The rebar set ID.

Tekla.Structures.ModelInternal.dotLegSurfaceObject_t.LayerNumber
The layer number.

Tekla.Structures.ModelInternal.dotLegSurfaceObject_t.OffsetType
The offset type.

Tekla.Structures.ModelInternal.dotLegSurfaceObject_t.Offset
The offset.

Tekla.Structures.ModelInternal.dotLegSurfaceObject_t.Frozen
The frozen value;